models/ShopDB.php

SELECT * FROM `shop` LIMIT 20
SELECT COUNT(*) FROM `shop`
---
    public function shoplist($list,$page,$demand=''){
        if ($demand == ''){
            $datas = $this::find();
        }else{
            $datas = $this::find()->Where(['like','user',$demand])->orWhere(['like','type',$demand]);
        }
        $pages = new Pagination(['totalCount' =>$datas->count(), 'pageSize' => $list]);
        $model = $datas->offset($page-1)->limit($pages->limit)->all();
        foreach ($model as $k=>$v){
            $model[$k] = $v->attributes;
        }
        $mod = json_encode($model);
        echo '{"total" : '.$datas->count().', "rows" : '.$mod.'}';

INSERT INTO `shop` (`user`, `time`, `type`, `img`, `price`, `nums`, `cont`, `remark`) VALUES ('瓶装向日葵', '2017-01-09 10:28:28', '向日葵,开业,瓶花,黄色', './uploads/img/5d4eb9.png', '30', 3, '想太阳一样', '')
---
    public function addshop($data){
        $this->user = $data['user'];
        $this->time = date("Y-m-d h:i:s");
        $this->type = $data['type'] .','.$data['yotu'].','.$data['baoz'] .','.$data['color'];
        $this->img = $data['img'];
        $this->price = $data['price'];
        $this->nums = $data['nums'];
        $this->cont = $data['cont'];
        $this->remark = $data['remark'];
        if ($this->save()){